Revit 2027 API
TransferredProjectStandardsEventArgs Methods
The TransferredProjectStandardsEventArgs type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSelectedExternalItems |  Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace